Repository: sslavik/acdat
Catalog: TMXParser/en-es.tmx
Source language: en
Languages: es

source: PLACE lacks a lot of features of a real programming language and any extension to it only enlarges the list of placeholders.
es: El PLACE no posee muchas de las características de un lenguaje de programación real y las extensiones al mismo únicamente alargan la lista de posicionadores.

source: This has led to the use of JavaScript which IMO does not make life easier.
es: Esto ha obligado al uso de JavaScript que, en mi opinión, no hace la vida más fácil.

source: Adding Hyperwave support to PHP should fill in the gap of a missing programming language for interface customisation.
es: Añadir soporte de Hyperwave al PHP rellenaría el espacio que deja la falta de un lenguaje de programación que permita personalizar la interfaz.

source: It implements all the messages as defined by the HG-CSP but also provides more powerful commands to e.g. retrieve complete documents.
es: El PHP implementa todos los mensajes definidos en el HG-CSP pero además proporciona comandos más poderosos, p. ej. recuperar documentos completos.

source: Hyperwave has its own terminology to name certain pieces of information.
es: El Hyperwave tiene su propia terminología para dar nombre a ciertos tipos de información.

source: This has widely been taken over and extended.
es: Esta ha sido ampliamente extendida y anulada.

source: Almost all functions operate on one of the following data types.
es: Casi todas las funciones operan en uno de los siguientes tipos de datos.

source: object ID:
es: ID de objeto:

source: An unique integer value for each object in the Hyperwave server.
es: Un valor entero único paara cada objeto del servidor Hyperwave.

source: It is also one of the attributes of the object record (ObjectID).
es: También es uno de los atributos del registro de objeto (ObjectID).

source: Object ids are often used as an input parameter to specify an object.
es: Los ID de objeto se usan generalmente como parámetros de entrada que especifican a un objeto.

source: object record:
es: registro de objeto:

source: A string with attribute-value pairs of the form attribute=value.
es: Una cadena con pares atributo-valor con la forma atributo=valos.

source: The pairs are separated by a carriage return from each other.
es: Los pares están separados unos de otros por un retorno de carro.

source: An object record can easily be converted into an object array with hw_object2array().
es: Un registro de objeto puede convertirse fácilmente en una tabla (array) de objetos usando hw_object2array().

source: Several functions return object records.
es: Varias funciones devuelven registros de objeto.

source: The names of those functions end with obj.
es: Los nombres de dichas funciones terminan en obj.

source: object array:
es: tabla de objetos:

source: An associative array with all attributes of an object.
es: Una tabla asociativa con todos los atributos de un objeto.

source: The keys are the attribute names.
es: La clave es el nombre del atributo.

source: If an attribute occurs more than once in an object record it will result in another indexed or associative array.
es: Si un atributo aparece más de una vez en un registro de objeto será convertido en otra tabla asociativa o indizada.

source: Attributes which are language depended (like the title, keyword, description) will form an associative array with the keys set to the language abbreviations.
es: Los atributos que dependen del idioma (como el título, claves o descripción) se convertirán en una tabla asociativa con la abreviatura del idioma como clave.

source: All other multiple attributes will form an indexed array.
es: El resto de los atributos múltiples crearán una tabla indizada.

source: PHP functions never return object arrays.
es: Las funciones de PHP nunca devuelven tablas de objetos.

source: This is a complete new data type which holds the actual document, e.g.
es: Este es un nuevo tipo de datos que almacena el documento actual, p. ej.

source: It is somewhat optimized for HTML documents but may be used for any format.
es: Está algo optimizado para documentos HTML pero puede usarse para cualquier formato.

source: The array is the last element of the object record array.
es: Varias funciones que devuelven una tabla de registros de objeto también devuelven una tabla asociativa con información estadística sobre los mismos.

source: The statistical array contains the following entries:
es: La tabla es el último elemento del registro de objeto.

source: Number of object records with attribute PresentationHints set to Hidden.
es: La tabla estadística contiene los siguientes elementos:

source: Number of object records with attribute PresentationHints set to CollectionHead.
es: Número de registros de objeto con el atributo PresentationHints puesto a Hidden.

source: Number of object records with attribute PresentationHints set to FullCollectionHead.
es: Número de registros de objeto con el atributo PresentationHints puesto a CollectionHead.

source: Index in array of object records with attribute PresentationHints set to CollectionHead.
es: Número de registros de objeto con el atributo PresentationHints puesto a FullCollectionHead.

source: Total:
es: Índice a una tabla de regitros de objeto con el atributo PresentationHints puesto a CollectionHead.

source: This extension needs a Hyperwave server downloadable from http: / /www.hyperwave.com /.
es: Índice a una tabla de regitros de objeto con el atributo PresentationHints puesto a FullCollectionHead.

source: The Hyperwave extension is best used when PHP is compiled as an Apache module.
es: Número de registros de objeto.

source: The following instructions will explain this.
es: La extensión Hyperwave se utiliza mejor cuando el PHP se compila como un módulo de Apache.

source: Since PHP with Hyperwave support built into Apache is intended to replace the native Hyperwave solution based on Wavemaster, we will assume that the Apache server will only serve as a Hyperwave web interface for these examples.
es: En tal caso el servidor Hyperwave subyacente puede ser ocultado casi por completo de los usuarios si el Apache utiliza su motor de re-escritura.

source: The concept is quite simple.
es: Las siguientes instrucciones explicarán esto.

source: Let' s call this script'Hyperwave '.
es: Como el PHP con soporte Hyperwave incluído en el Apache se ha diseñado para sustituir la solución nativa de Hyperwave basada en Wavemaster, asumiré que el servidor Apache sólo sirve como interfaz web para el Hyperwave.

source: The URL http: / /your.hostname / Hyperwave / name_of_object would than return the Hyperwave object with the name 'name_of_object'.
es: Esto no es necesario, pero simplifica la configuración.

source: Depending on the type of the object the script has to react accordingly.
es: El concepto es bastante sencillo.

source: If it is a document it will return the mime type and the content.
es: Primeramente necesita un script PHP que evalúe la variable PATH_INFO y que trate su valor como el nombre de un objeto Hyperwave.

source: A slight improvement can be achieved if the Apache rewriting engine is used.
es: Llamemos a este script 'Hyperwave'.

source: The rewriting rule is quite easy:
es: El URL http: / /nombre.servidor / Hyperwave / nombre_de_objeto El URL http: / /nombre.servidor / Hyperwave / nombre_de_objeto devolvería entonces el objeto Hyperwave llamado 'nombre_de_objeto'.

source: RewriteRule ^ / (.*) / usr / local / apache / htdocs / HyperWave / $1 [L]
es: Dependiendo del tipo del objeto, así reaccionará el script.

source: RewriteRule ^ / hw / (.*) / usr / local / apache / htdocs / hw / $1 [L]
es: Si es una colección, probablemente devolverá un lista de hijos.

source: to return the object itself
es: Si es un documento devolverá el tipo MIME y el contenido.

source: to identify yourself
es: Se puede mejorar ligeramente si se usa el motor de re-escritura del Apache.

source: one for each additional function like to show the object attributes, to show information about users, to show the status of the server, etc.
es: Desde el punto de vista del usuario será más sencillo si el URL http: / /nombre.servidor / nombre de objeto devuelve el objeto.

source: As an alternative to the Rewrite Engine, you can also consider using the Apache ErrorDocument directive, but be aware, that ErrorDocument redirected pages cannot receive POST data.
es: La regla de reescritura es muy sencilla:

source: Changeable
es: para devolver el script en sí

source: hyperwave.default_port
es: para identificarse

source: PHP_INI_ALL
es: para ajustar su perfil

source: There are still some things to do:
es: Aún hay varias cosas pendientes:

source: The hw_InsertDocument has to be split into hw_insertobject() and hw_putdocument().
es: hw_InsertDocument debe dividirse en hw_InsertObject() y hw_PutDocument().

source: The names of several functions are not fixed, yet.
es: Los nombres de algunas funciones aún no están fijados.

source: Most functions require the current connection as its first parameter.
es: Muchas funciones precisan la conexión actual como primer parámetro.

source: This leads to a lot of typing, which is quite often not necessary if there is just one open connection.
es: Esto obliga a escribir mucho, lo cual no es con frecuencia necesario si sólo hay una conexión abierta.

source: A default connection will improve this.
es: Una conexión por defecto mejoraría esto.

source: Conversion form object record into object array needs to handle any multiple attribute.
es: La conversión de registro de objeto a tabla de objeto necesita manipular cualquier atributo múltiple.

source: More information about InterBase is available at http: / /www.interbase.com /.
es: Manual de PHP

source: This database uses a single quote (') character for escaping, a behavior similar to the Sybase database, add to your php.ini the following directive:
es: Siguiente

source: To enable InterBase support configure PHP --with-interbase[ =DIR], where DIR is the InterBase base install directory, which defaults to / usr / interbase.
es: Anterior

source: In order to enable this module on a Windows environment, you must copy gds32.dll from the DLL folder of the PHP / Win32 binary package to the SYSTEM32 folder of your windows machine. (Ex:
es: Inicio

source: In case you installed the InterBase database server on the same machine PHP is running on, you will have this DLL already.
es: Siguiente

source: Table 2. iconv constants
es: Tabla 2. iconv constants

source: IDS 7.x support is fairly complete, with full support for BYTE and TEXT columns.
es: El conector para Informix Online (ODS) 7.x, SE 7.x y Universal Server (IUS) 9.x se encuentra implementado en "functions / ifx.ec "y "functions / php3_ifx.h".

source: Configuration notes:
es: Para ODS 7.x está completado, con total soporte para columnas de tipo BYTE y TEXT.

source: ESQL / C versions from 7.2x on should be OK.
es: Para IUS 9.x está parcialmente finalizado: los tipos de datos nuevos están allí (en el IUS 9.x), pero la funcionalidad para SLOB y CLOB se encuentra bajo construcción todavía.

source: ESQL / C is now part of the Informix Client SDK.
es: Notas de configuración:

source: Make sure that the "INFORMIXDIR" variable has been set, and that $INFORMIXDIR / bin is in your PATH before you run the "configure "script.
es: Antes de ejecutar el guión (script) "configure", asegúrate que la variable "INFORMIXDIR "ha sido definida.

source: Make sure that the Informix environment variables INFORMIXDIR and INFORMIXSERVER are available to the PHP ifx driver, and that the INFORMIX bin directory is in the PATH.
es: Puedes obviar esta detección definiendo las variables de entorno "IFX_LIBDIR", "IFX_LIBS" y "IFX_INCDIR ".

source: The phpinfo() output should list these environment variables.
es: Definirás la variable de compilación condicional "HAVE_IFX_IUS" si la versión de Informix es 9.00 o superior.

source: You may have to set these environment variables in your Apache startup script.
es: Algunas notas sobre el uso de BLOBs (columnas de tipo TEXT y BYTE):

source: Some notes on the use of BLOBs (TEXT and BYTE columns):
es: BLOBs son normalmente manipulados por enteros, los cuales representan identificadores de BLOB.

source: Select queries return a "blob id" for every BYTE and TEXT column.
es: Las consultas de selección devuelven un "blob id" para columnas de tipo BYTE y TEXT.

source: If you prefer to receive the content of BLOB columns in a file, use "ifx_blobinfile(1) ;", and "ifx_get_blob($blob_id);" will get you the filename.
es: Si eliges trabajar con los BLOBs en memoria (con: "ifx_blobinfile(0) ;") entonces puedes obtener el contenido con "string_var = ifx_get_blob($blob_id); ".

source: For insert / update queries you must create these "blob id's" yourself with "ifx_create_blob();".
es: Si prefieres manipularlos en ficheros usa "ifx_blobinfile(1);" y "ifx_get_blob($blob_id); "devolverá el nombre del archivo.

source: For updates / inserts, you are responsible for setting the blob contents with ifx_update_blob().
es: En este caso, utiliza las funciones habituales de entrada y salida de ficheros para obtener el contenido de los blob.

source: configuration variable: ifx.textasvarchar
es: Para consultas de inserción y actualización debes crear estos identificadores de blob con "ifx_create_blob(..);".

source: runtime functions:
es: Entonces pondrás los identificadores de blob en un array y sustituirás en la cadena de la consulta las columnas de tipo blob por una interrogación (?).

source: ifx_byteasvarchar( 0): use blob id's for select queries with BYTE columns
es: Para inserciones y actualizaciones eres responsable de definir el contenido de los blob con ifx_update_blob(...).

source: ifx_byteasvarchar( 1): return BYTE columns as if they were VARCHAR columns, so that you don't need to use blob id's for select queries.
es: La conducta de columnas BLOB puede ser modificada mediante variables de configuración, las cuales pueden ser definidas en tiempo de ejecución mediante funciones.

source: runtime function:
es: variable de configuración: ifx.textasvarchar

source: ifx_blobinfile_mode( 0): return BYTE columns in memory, the blob id lets you get at the contents.
es: variable de configuración: ifx.byteasvarchar

source: ifx_blobinfile_mode( 1): return BYTE columns in a file, the blob id lets you get at the file name.
es: funciones en tiempo de ejecución:

source: Since all strings are "counted" in PHP, this remains "binary safe ".
es: ifx_textasvarchar( 0): usa identificadores de blob para columnas de tipo TEXT en las consultas de selección

source: The returned data can contain anything, you are responsible for the contents.
es: ifx_byteasvarchar( 0): usa identificadores de blob para columnas de tipo BYTE en las consultas de selección

source: Note that in this case YOU ARE RESPONSIBLE FOR DELETING THE TEMPORARY FILES CREATED BY INFORMIX when fetching the row.
es: ifx_textasvarchar( 1): devuelve columnas de tipo TEXT como si fueran de tipo VARCHAR, sin tener que usar identificadores de blob en las consultas de selección

source: The location of the temporary files can be influenced by the environment variable "blobdir", default is". "(the current directory).
es: ifx_byteasvarchar( 1): devuelve columnas de tipo BYTE como si fueran de tipo VARCHAR, sin tener que usar identificadores de blob en las consultas de selección.

source: Something like: putenv( blobdir=tmpblob"); will ease the cleaning up of temp files accidentally left behind (their names all start with "blb").
es: función en tiempo de ejecución:

source: This can be set with the configuration variable
es: ifx_blobinfile_mode( 0): devuelve columnas de tipo BYTE en memoria, el identificador de blob te permite obtener el contenido.

source: NULL values:
es: ifx_blobinfile_mode( 1): devuelve columnas de tipo BYTE en un fichero, el identificador te permite saber el nombre de dicho archivo.

source: This allows you to discriminate between NULL columns and empty columns.
es: Si defines ifx_text / byteasvarchar a 1 entonces puedes usar columnas de tipo TEXT y BYTE en las consultas de selección como campos de tipo VARCHAR, pero teniendo en cuenta que tendrán un mayor tamaño que el habitual.

source: Informix configuration options
es: Ya que en PHP todas las cadenas son posibles, esto permite datos binarios.

source: ifx.allow_persistent
es: De esta forma, se pueden manejar correctamente.

source: ifx.max_persistent
es: La información devuelta puede contener cualquier cosa, tú eres responsable del contenido.

source: ifx.default_password
es: Si defines ifx_blobinfile a 1, utiliza el nombre del archivo devuelto por ifx_get_blob(..) para acceder a los contenidos del blobs.

source: The maximum number of persistent Informix connections per process.
es: Cada nueva fila obtenida creará un nuevo archivo temporal para cada columna de tipo BYTE.

source: The default host to connect to when no host is specified in ifx_connect() or ifx_pconnect().
es: El directorio donde se guardan los archivos temporales puede ser definido por la variable de entorno blobdir, por defecto es ".", es decir, el directorio actual.

source: The default user id to use when none is specified in ifx_connect() or ifx_pconnect().
es: Así, putenv( blobdir=tmpblob"); definirá un directorio donde se localizarán todos los ficheros temporales y facilitará su borrado.

source: The default password to use when none is specified in ifx_connect() or ifx_pconnect().
es: Todos los nombres de los archivos comienzan por "blb".

source: Set to TRUE if you want to return blob columns in a file, FALSE if you want them in memory.
es: Recortado (trimming) automático de datos de tipo "char "(SQLCHAR y SQLNCHAR):

source: Set to TRUE if you want to return TEXT columns as normal strings in select statements, FALSE if you want to use blob id parameters.
es: Puede ser definido con la variable de configuración

source: Set to TRUE if you want to return BYTE columns as normal strings in select queries, FALSE if you want to use blob id parameters.
es: ifx.charasvarchar: si se define a 1 eliminará automáticamente los espacios en blanco al final de la cadena.

source: You can override the setting at runtime with ifx_textasvarchar().
es: Valores NULL:

source: Set to TRUE if you want to return NULL columns as the literal string "NULL", FALSE if you want them returned as the empty string "".
es: La variable de configuración ifx.nullformat (y en tiempo de ejecución ifx_nullformat()) cuando sea definida a TRUE devolverá columnas NULL como la cadena "NULL", si es definida a FALSE La variable de configuración ifx.nullformat (y en tiempo de ejecución ifx_nullformat()) cuando sea definida a TRUE devolverá columnas NULL como la cadena "NULL", si es definida a FALSE entonces la cadena vacía.

source: If you have the GD library (available at http: / /www.boutell.com / gd /) you will also be able to create and manipulate images.
es: Puede usar las funciones para imágenes en PHP para obtener el tamaño de imágenes JPEG, GIF, PNG, SWF, TIFF y JPEG2000, y si tiene instalada la biblioteca GD (disponible en http: / /www.boutell.com / gd /) también podrá crear y manipular imágenes.

source: Versions of GD older than gd-1.6 support GIF format images, and do not support PNG, where versions greater than gd-1.6 support PNG, not GIF.
es: Si tiene PHP compilado con --enable-exif puede trabajar con la información guardada en las cabeceras de las imágenes JPEG y TIFF.

source: You may wish to enhance GD to handle more image formats.
es: Estas funciones no requieren la biblioteca GD.

source: Enhance the capabilities of GD to deal with different fonts by specifying the --with-XXXX configure switch to your PHP configure line.
es: Los formatos de imágenes que puede manipular dependen de la versión de GD que instale y de cualquier otra biblioteca que GD pueda necesitar para acceder a esos formatos de imagen.

source: This setting cannot be empty but you can specify a list of encodings supported by mbstring.
es: Las versiones de GD anteriores a la GD-1.6 soportan imágenes en formato gif y no soportan png, mientras que las versiones superiores a la GD-1.6 soportan el formato png y no el gif.

source: exif.decode_jis_motorola defines the image internal characterset for JIS encoded user comments if image is in motorola byte order (big-endian).
es: También tendrá que compilar PHP con la opción --with-jpeg-dir= / ruta / a/jpeg-6b.

source: The underlying c-client library also supports NNTP, POP3 and local mailbox access methods.
es: Para hacer funcionar estas funciones, debe compilar PHP con --with-imap.

source: It 's important that you do not copy the IMAP source files directly into the system include directory as there may be conflicts.
es: Esto requiere que la libreria c-client esté instalada.

source: Additionally when you compiled IMAP, a file named c-client-a was created.
es: Obtenga la última versión de ftp: / /ftp.cac.washington.edu / imap / y compílela.

source: To get these functions to work, you have to compile PHP with --with-imap[ =DIR], where DIR is the c-client install prefix.
es: Luego copie c-client / c-client.a al directorio / usr / local / lib o a cualquier otro directorio de su LINK path y copie c-client / rfc822.h, mail.h y linkage.h al directorio / usr / local / include o a cualquier otro de su INCLUDE path.

source: Further information is provided by the documentation of the c-client library source (docs / internal.txt). and the following RFC documents:
es: Vea imap_open() para una mayor información.

source: You 'll also find functions to set options for your running PHP.
es: Manual de PHP

source: If enabled, no errors are shown (implicit error_reporting(0)) while evaluation.
es: Siguiente

source: You can turn dynamic loading of PHP extensions with dl() on and off per virtual server or per directory.
es: Anterior

source: This helps prevent poorly written scripts from tying up the server.
es: Inicio

source: When magic_quotes are on, all '(single-quote), "(double quote),\ (backslash) and NUL's are escaped with a backslash automatically.
es: Siguiente

source: If magic_quotes_sybase is also on, a single-quote is escaped with a single-quote instead of a backslash.
es: Subir

source: The result of a query must be treated before sending another query, and a transaction must be commited or rolled back before opening another transaction (which is automaticaly done when sending the first query).
es: Este módulo es EXPERIMENTAL.

source: To compile PHP with Ingres support, you need the Open API library and header files included with Ingres II.
es: Quedas avisado, y utilizar este módulo es tu responsabiliad.

source: When using this extension with Apache, if Apache does not start and complains with "PHP Fatal error:
es: In order to have these functions available, you must compile php with Ingres support by using the --with-ingres option.

source: Unable to start ingres_ii module in Unknown on line 0 "then make sure the environement variable II_SYSTEM is correctly set.
es: You need the Open API library and header files included with Ingres II.

source: ingres.default_user
es: Nota:

source: LDAP is the Lightweight Directory Access Protocol, and is a protocol used to access "Directory Servers".
es: LDAP es el protocolo de acceso a directorios ligero (Lightweight Directory Access Protocol), un protocolo usado para acceder a "Servidores de Directorio ".

source: The Directory is a special kind of database that holds information in a tree structure.
es: El directorio es una clase especial de base de datos que contiene información estructurada en forma de árbol.
